In [17]:
import numpy as np
import pandas as pd

from pandasql import sqldf

pysqldf = lambda q: sqldf(q, globals())

In [18]:
!ls data

adult.data.csv	android_devices.csv  user_device.csv  user_usage.csv

In [32]:
user_usage = pd.read_csv('data/user_usage.csv')
user_device = pd.read_csv('data/user_device.csv')
devices = pd.read_csv('data/android_devices.csv')

In [28]:
user_usage.head()

   outgoing_mins_per_month  outgoing_sms_per_month  monthly_mb  use_id
0                    21.97                    4.82     1557.33   22787
1                  1710.08                  136.88     7267.55   22788
2                  1710.08                  136.88     7267.55   22789
3                    94.46                   35.17      519.12   22790
4                    71.59                   79.26     1557.33   22792

In [29]:
user_device.head()

   use_id  user_id platform  platform_version     device  use_type_id
0   22782    26980      ios              10.2  iPhone7,2            2
1   22783    29628  android               6.0    Nexus 5            3
2   22784    28473  android               5.1   SM-G903F            1
3   22785    15200      ios              10.2  iPhone7,2            3
4   22786    28239  android               6.0  ONE E1003            1

In [30]:
devices.head()

  Retail Branding Marketing Name    Device                      Model
0             NaN            NaN    AD681H  Smartfren Andromax AD681H
1             NaN            NaN     FJL21                      FJL21
2             NaN            NaN       T31              Panasonic T31
3             NaN            NaN  hws7721g         MediaPad 7 Youth 2
4              3Q        OC1020A   OC1020A                    OC1020A

In [151]:
%%timeit

result = pd.merge(user_usage, user_device[['use_id', 'platform', 'device']], on='use_id')

In [ ]:
result.head()

In [152]:
%%timeit

result = pd.merge(
    result,
    devices[['Device', 'Retail Branding']],
    left_on='device',
    right_on='Device'
).drop(axis='columns', labels='Device')
result.rename(columns={'Retail Branding' : "manufacturer"}, inplace=True)

In [146]:
%%timeit

means = result.groupby('manufacturer').agg({
    "outgoing_mins_per_month": "mean",
    "outgoing_sms_per_month": "mean",
    "monthly_mb": "mean",
    "use_id": "count"
})

,outgoing_mins_per_month,outgoing_sms_per_month,monthly_mb,use_id
manufacturer,,,,
Lava,60.650000,261.900000,12458.670000,2
OnePlus,170.395000,62.100000,15573.330000,4
Sony,143.703846,39.114615,2715.352308,13

In [ ]:
means

In [150]:
query1 = \
"""
SELECT * FROM user_usage
INNER JOIN
(SELECT use_id, platform, device FROM user_device) as usage
ON
user_usage.use_id=usage.use_id
"""

query2 = \
"""
SELECT * FROM sql_usage
INNER JOIN
(SELECT "Retail Branding" as manufacturer, Device as device FROM devices) as devices
ON
sql_usage.device=devices.device
"""

query3 = \
"""
SELECT
    manufacturer,
    AVG(outgoing_mins_per_month), AVG(outgoing_sms_per_month),
    AVG(monthly_mb), COUNT(use_id)
FROM sql_result GROUP BY manufacturer
"""

,manufacturer,AVG(outgoing_mins_per_month),AVG(outgoing_sms_per_month),AVG(monthly_mb),COUNT(use_id)
0,Lava,60.650000,261.900000,12458.670000,2
1,OnePlus,170.395000,62.100000,15573.330000,4
2,Sony,143.703846,39.114615,2715.352308,13

In [ ]:
%%timeit

sql_usage = pysqldf(query1)

In [ ]:
sql_usage.head()

In [ ]:
%%timeit

sql_result = pysqldf(query2)

In [ ]:
sql_result.head()

In [ ]:
%%timeit

sql_means = pysqldf(query3)

In [ ]:
sql_means